In [12]:
# Identifying Duplicates from dataset 

import pandas as pd

In [13]:
df_new=pd.read_csv("education.csv")

In [14]:
df_new

     datasrno  workex  gmat
0           1      21   720
1           2     107   640
2           3      57   740
3           4      99   690
4           5     208   710
..        ...     ...   ...
768       769      88   620
769       770     132   670
770       771      28   610
771       772      10   610
772       773      52   620

[773 rows x 3 columns]

In [15]:
df_new.head(5)

   datasrno  workex  gmat
0         1      21   720
1         2     107   640
2         3      57   740
3         4      99   690
4         5     208   710

In [ ]:
duplicate=df_new.duplicated()
#output of this function is single column
#if there there is a duplicate records output will be --->>>> True
# if there is no duplicate records output will be ---->> False
# Series will be created
duplicate

In [17]:
sum(duplicate)
#ouput is 0

0

# so here the duplicates data value is 0 mena it False
# there are no duplicate in this dataset